In [ ]:
import  pandas as pd

In [ ]:
import numpy as np

In [ ]:
data = [[1, 'John', 100000, 6, '4/1/2006'], [2, 'Amy', 12000, 5, '5/1/2010'], [3, 'Mark', 65000, 12, '12/25/2008'], [4, 'Pam', 25000, 25, '1/1/2005'], [5, 'Alex', 5000, 10, '2/3/2007']]
sales_person = pd.DataFrame(data, columns=['sales_id', 'name', 'salary', 'commission_rate', 'hire_date']).astype({'sales_id':'Int64', 'name':'object', 'salary':'Int64', 'commission_rate':'Int64', 'hire_date':'datetime64[ns]'})
data = [[1, 'RED', 'Boston'], [2, 'ORANGE', 'New York'], [3, 'YELLOW', 'Boston'], [4, 'GREEN', 'Austin']]
company = pd.DataFrame(data, columns=['com_id', 'name', 'city']).astype({'com_id':'Int64', 'name':'object', 'city':'object'})
data = [[1, '1/1/2014', 3, 4, 10000], [2, '2/1/2014', 4, 5, 5000], [3, '3/1/2014', 1, 1, 50000], [4, '4/1/2014', 1, 4, 25000]]
orders = pd.DataFrame(data, columns=['order_id', 'order_date', 'com_id', 'sales_id', 'amount']).astype({'order_id':'Int64', 'order_date':'datetime64[ns]', 'com_id':'Int64', 'sales_id':'Int64', 'amount':'Int64'})

In [34]:
test=orders.merge(company,on="com_id",how="left")
test=test[["sales_id","name"]]
test=test.rename(columns={"name":"name_company"})
test

   sales_id name_company
0         4       YELLOW
1         5        GREEN
2         1          RED
3         4          RED

In [35]:
sales_person

   sales_id  name  salary  commission_rate  hire_date
0         1  John  100000                6 2006-04-01
1         2   Amy   12000                5 2010-05-01
2         3  Mark   65000               12 2008-12-25
3         4   Pam   25000               25 2005-01-01
4         5  Alex    5000               10 2007-02-03

In [36]:
test=sales_person.merge(test,on="sales_id",how="left", suffixes=('', ''))
test

   sales_id  name  salary  commission_rate  hire_date name_company
0         1  John  100000                6 2006-04-01          RED
1         2   Amy   12000                5 2010-05-01          NaN
2         3  Mark   65000               12 2008-12-25          NaN
3         4   Pam   25000               25 2005-01-01       YELLOW
4         4   Pam   25000               25 2005-01-01          RED
5         5  Alex    5000               10 2007-02-03        GREEN

In [37]:
test[["name","name_company"]]

   name name_company
0  John          RED
1   Amy          NaN
2  Mark          NaN
3   Pam       YELLOW
4   Pam          RED
5  Alex        GREEN

In [44]:
name_with_red=test[(test["name_company"]=="RED")]["name"]
name_with_red

0    John
4     Pam
Name: name, dtype: object

In [43]:
test.loc[test["name_company"] != "RED", "name"]

1     Amy
2    Mark
3     Pam
5    Alex
Name: name, dtype: object

In [45]:
test=test[~test["name"].isin(name_with_red)]

In [30]:
test=test[~test["name"].isin(name_with_red)]
test=test[["name"]].drop_duplicates()
test

   name
1   Amy
2  Mark
5  Alex

In [ ]:
def sales_person(sales_person: pd.DataFrame, compant: pd.DataFrame, orders: pd.DataFrame) -> pd.DataFrame:
    output=orders.merge(company,on="com_id", how="left")
    output=output[["sales_id","name"]]
    
    output=output.rename(columns={"name":"name_company"})
    output=sales_person.merge(output,on="sales_id",how="left", suffixes=('', ''))
    output=output[["name","name_compamy"]]
    name_with_red=output[output["name_company"]=="RED"]["name"]
    output=output[~output["name"].isin(name_with_red)]
    
    return output

In [2]:
import pandas as pd
data = [['Afghanistan', 'Asia', 652230, 25500100, 20343000000], ['Albania', 'Europe', 28748, 2831741, 12960000000], ['Algeria', 'Africa', 2381741, 37100000, 188681000000], ['Andorra', 'Europe', 468, 78115, 3712000000], ['Angola', 'Africa', 1246700, 20609294, 100990000000]]
world = pd.DataFrame(data, columns=['name', 'continent', 'area', 'population', 'gdp']).astype({'name':'object', 'continent':'object', 'area':'Int64', 'population':'Int64', 'gdp':'Int64'})

In [3]:
world

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [7]:
def big_countries(world: pd.DataFrame) -> pd.DataFrame:
    condition = (world["area"] >= 3000000) | (world["population"] >= 25000000)
    filtered_world = world[condition]
    filtered_world=filtered_world[["name","population","area"]]
    return filtered_world

In [8]:
big_countries(world)

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741

In [9]:
data = [['0', 'Y', 'N'], ['1', 'Y', 'Y'], ['2', 'N', 'Y'], ['3', 'Y', 'Y'], ['4', 'N', 'N']]
products = pd.DataFrame(data, columns=['product_id', 'low_fats', 'recyclable']).astype({'product_id':'int64', 'low_fats':'category', 'recyclable':'category'})

In [10]:
products

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [27]:
def find_products(products: pd.DataFrame) -> pd.DataFrame:
    Condition=(products["low_fats"]=="Y") & (products["recyclable"]=="Y")
    products=products[Condition]
    products=products[["product_id"]]
    return products

In [28]:
find_products(products)

   product_id
1           1
3           3

In [1]:
import pandas as pd

data = {
    'Category': ['A', 'B', 'C', 'A', 'B', 'C'],
    'Value': [10, 15, 20, 25, 30, 35]
}

df = pd.DataFrame(data)
df.index = ['One', 'Two', 'Three', 'Four', 'Five', 'Six']

print("Original DataFrame:")
print(df)

Original DataFrame:
      Category  Value
One          A     10
Two          B     15
Three        C     20
Four         A     25
Five         B     30
Six          C     35

In [2]:
grouped_df = df.groupby('Category').sum()
print("\nGrouped DataFrame:")
print(grouped_df)

Grouped DataFrame:
          Value
Category
A            35
B            45
C            55

In [3]:
reset_df = grouped_df.reset_index()
print("\nDataFrame after reset_index():")
print(reset_df)

DataFrame after reset_index():
  Category  Value
0        A     35
1        B     45
2        C     55

# concat功能

In [4]:
import pandas as pd

# 創建 DataFrame 1
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})

# 創建 DataFrame 2
df2 = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})

# 創建 DataFrame 3
df3 = pd.DataFrame({'A': [9, 10], 'B': [11, 12]})

In [9]:
result_dfs = {'df1': df1, 'df2': df2, 'df3': df3}
final_result = pd.concat(result_dfs.values(), ignore_index=True)
final_result

    A   B
0   1   3
1   2   4
2   5   7
3   6   8
4   9  11
5  10  12

In [11]:
import pandas as pd

# 假設這是你的 DataFrame
data = {
    'ComplaintFlag': [1, 0, 1, 0, 1],
    'column1': ['A', 'B', 'C', 'D', 'E'],
    'column2': [10, 20, 30, 40, 50]
}

select_df = pd.DataFrame(data)

# 使用 .loc 選擇滿足條件的行和指定的列
result = select_df.loc[select_df['ComplaintFlag'] == 1, ['column1', 'column2']]
print(select_df)
# 顯示結果
print(result)

   ComplaintFlag column1  column2
0              1       A       10
1              0       B       20
2              1       C       30
3              0       D       40
4              1       E       50
  column1  column2
0       A       10
2       C       30
4       E       50

In [12]:
import pandas as pd

# 創建一個 DataFrame
data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}

df = pd.DataFrame(data, index=['row1', 'row2', 'row3'])

# 使用 .loc
result_loc = df.loc['row1', 'B']  # 得到的是標籤為 'row1' 和 'B' 的元素值

# 使用 .iloc
result_iloc = df.iloc[0, 1]  # 得到的是行索引為 0 和列索引為 1 的元素值

In [15]:
df

      A  B  C
row1  1  4  7
row2  2  5  8
row3  3  6  9

In [2]:
import pandas as pd
data = [[1, 'Joe'], [2, 'Henry'], [3, 'Sam'], [4, 'Max']]
customers = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})
data = [[1, 3], [2, 1]]
orders = pd.DataFrame(data, columns=['id', 'customerId']).astype({'id':'Int64', 'customerId':'Int64'})

In [4]:
customers

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [3]:
orders

   id  customerId
0   1           3
1   2           1

In [22]:
merge=customers.merge(orders,how="left", left_on='id', right_on='customerId')
mask = merge['customerId'].isna()
mask
result_df = merge[mask]
result_df

   id_x   name  id_y  customerId
1     2  Henry  <NA>        <NA>
3     4    Max  <NA>        <NA>

In [ ]:
df = customers[~customers['id'].isin(orders['customerId'])]

In [ ]:
import pandas as pd

def find_customers(customers: pd.DataFrame, orders: pd.DataFrame) -> pd.DataFrame:
    # Select the customers whose 'id' is not present in the orders DataFrame's 'customerId' column.
    df = customers[~customers['id'].isin(orders['customerId'])]

    # Build a DataFrame that only contains the 'name' column and rename it as 'Customers'.
    df = df[['name']].rename(columns={'name': 'Customers'})

    return df

In [23]:
data = [[1, 3, 5, '2019-08-01'], [1, 3, 6, '2019-08-02'], [2, 7, 7, '2019-08-01'], [2, 7, 6, '2019-08-02'], [4, 7, 1, '2019-07-22'], [3, 4, 4, '2019-07-21'], [3, 4, 4, '2019-07-21']]
views = pd.DataFrame(data, columns=['article_id', 'author_id', 'viewer_id', 'view_date']).astype({'article_id':'Int64', 'author_id':'Int64', 'viewer_id':'Int64', 'view_date':'datetime64[ns]'})

In [48]:
test=views[views["author_id"]==views["viewer_id"]]
test=test.drop_duplicates(subset="viewer_id",ignore_index=True)
test=test["viewer_id"].sort_values()
test=pd.DataFrame({"id":test})
test

   id
1   4
0   7

In [33]:
views.groupby("author_id")["viewer_id"].count()

author_id
3    2
4    2
7    3
Name: viewer_id, dtype: int64